#include "htc.h"
#include "define.h"
#include "pwm.h"
#include "timer.h"


void init_timer0(void);

/**************************************************************************************************
;函数名: init_timer0
;
;函数说明: Timer0初始化，例程中用到Timer0定时2ms
;				
;入口参数:  无
;
;返回值: 	无
;
;备注说明: 	相关寄存器的某些位使用宏定义列出可选的功能组合，用户通过修改相关"宏名"来修改相应配置，
;			可通过"查找/搜索"找到对应的"宏名"来进行调整
;
;			内部快时钟:	Fosc = 4MHz 		
;			指令时钟:		Fcpu = Fosc / 4  (Fcpu = 1MHz)
;			指令周期:		Tcpu = 1 / Fcpu  (Tcpu = 1us)
;			T0分频比选择 8 分频，T0计数周期为 8us
;			
***************************************************************************************************/
void init_timer0(void)
{
	T0_CLK_DIV_8();	//用户根据需要修改，(这里 T0时钟预分频比选择1:8 )

	PSC_SEL_T0();
	T0_CLK_SEL_FOSC_DIV4();		//用户根据需要修改，T0 时钟源选择 
	
	TMR0 = 6;					//用户根据需要修改，设置 T0初始值	(6 = 256 - 250)	2ms = 250 * 8us	(Fosc = 4MHz，T0预分频比选择1:8)
	TMR0EN = 1;					// Timer0使能位		1:Timer0打开		0:Timer0关闭

}

